Repository: yojimbo187-alt/fud-ai
Catalog: ios/calorietracker/LocalModels.xcstrings
Source language: en
Languages: ar, az, de, es, fi, fr, hi, it, ja, ko, nl, pl, pt_br, ro, ru, uk, zh_hans

# common.cancel
source: Cancel
ar: إلغاء
az: Ləğv et
de: Abbrechen
es: Cancelar
fi: Peruuta
fr: Annuler
hi: रद्द करें
it: Annulla
ja: キャンセル
ko: 취소
nl: Annuleren
pl: Anuluj
pt_br: Cancelar
ro: Anulează
ru: Отмена
uk: Скасувати
zh_hans: 取消

# common.delete
source: Delete
ar: حذف
az: Sil
de: Löschen
es: Eliminar
fi: Poista
fr: Supprimer
hi: हटाएं
it: Elimina
ja: 削除
ko: 삭제
nl: Verwijderen
pl: Usuń
pt_br: Apagar
ro: Șterge
ru: Удалить
uk: Видалити
zh_hans: 删除

# common.deleteModel
source: Delete Model
ar: حذف النموذج
az: Modeli sil
de: Modell löschen
es: Eliminar modelo
fr: Supprimer le modèle
hi: मॉडल हटाएं
it: Elimina modello
ja: モデルを削除
ko: 모델 삭제
nl: Model verwijderen
pl: Usuń model
pt_br: Excluir modelo
ro: Șterge modelul
ru: Удалить модель
uk: Видалити модель
zh_hans: 删除模型

# common.download
source: Download
ar: تنزيل
az: Endir
de: Herunterladen
es: Descargar
fi: Lataa
fr: Télécharger
hi: डाउनलोड करें
it: Scarica
ja: ダウンロード
ko: 다운로드
nl: Downloaden
pl: Pobierz
pt_br: Baixar
ro: Descarcă
ru: Скачать
uk: Завантажити
zh_hans: 下载

# common.downloaded
source: Downloaded
ar: تم التنزيل
az: Endirilib
de: Heruntergeladen
es: Descargado
fr: Téléchargé
hi: डाउनलोड किया गया
it: Scaricato
ja: ダウンロード済み
ko: 다운로드됨
nl: Gedownload
pl: Pobrano
pt_br: Baixado
ro: Descărcat
ru: Загружено
uk: Завантажено
zh_hans: 已下载

# common.inUse
source: In use
ar: قيد الاستخدام
az: İstifadədədir
de: Wird verwendet
es: En uso
fr: Utilisé
hi: उपयोग में
it: In uso
ja: 使用中
ko: 사용 중
nl: In gebruik
pl: W użyciu
pt_br: Em uso
ro: În uz
ru: Используется
uk: Використовується
zh_hans: 使用中

# common.needsAttention
source: Needs attention
ar: يحتاج إلى انتباه
az: Diqqət tələb edir
de: Erfordert Aufmerksamkeit
es: Requiere atención
fi: Vaatii huomiota
fr: Nécessite votre attention
hi: ध्यान देने की आवश्यकता है
it: Richiede attenzione
ja: 対応が必要です
ko: 확인 필요
nl: Vereist aandacht
pl: Wymaga uwagi
pt_br: Requer atenção
ro: Necesită atenție
ru: Требует внимания
uk: Потребує уваги
zh_hans: 需要处理

# common.notDownloaded
source: Not downloaded
ar: لم يتم التنزيل
az: Endirilməyib
de: Nicht heruntergeladen
es: No descargado
fr: Non téléchargé
hi: डाउनलोड नहीं किया गया
it: Non scaricato
ja: 未ダウンロード
ko: 다운로드되지 않음
nl: Niet gedownload
pl: Nie pobrano
pt_br: Não baixado
ro: Nedescărcat
ru: Не загружено
uk: Не завантажено
zh_hans: 未下载

# common.prepare
source: Prepare
ar: تحضير
az: Hazırla
de: Vorbereiten
es: Preparar
fr: Préparer
hi: तैयार करें
it: Prepara
ja: 準備
ko: 준비
nl: Voorbereiden
pl: Przygotuj
pt_br: Preparar
ro: Pregătește
ru: Подготовить
uk: Підготувати
zh_hans: 准备

# common.preparing
source: Preparing
ar: جارٍ التحضير
az: Hazırlanır
de: Wird vorbereitet
es: Preparando
fr: Préparation
hi: तैयार किया जा रहा है
it: Preparazione
ja: 準備中
ko: 준비 중
nl: Wordt voorbereid
pl: Przygotowywanie
pt_br: Preparando
ro: Se pregătește
ru: Подготовка
uk: Підготовка
zh_hans: 正在准备

# common.ready
source: Ready
ar: جاهز
az: Hazırdır
de: Bereit
es: Listo
fr: Prêt
hi: तैयार
it: Pronto
ja: 準備完了
ko: 준비됨
nl: Gereed
pl: Gotowe
pt_br: Pronto
ro: Gata
ru: Готово
uk: Готово
zh_hans: 就绪

# common.verifying
source: Verifying
ar: جارٍ التحقق
az: Yoxlanılır
de: Wird überprüft
es: Verificando
fr: Vérification
hi: पुष्टि की जा रही है
it: Verifica
ja: 検証中
ko: 확인 중
nl: Wordt geverifieerd
pl: Weryfikowanie
pt_br: Verificando
ro: Se verifică
ru: Проверка
uk: Перевірка
zh_hans: 正在验证

# gemma.providerName
source: Gemma 4 E2B (On-Device)
ar: Gemma 4 E2B (على الجهاز)
az: Gemma 4 E2B (cihazda)
de: Gemma 4 E2B (auf dem Gerät)
es: Gemma 4 E2B (en el dispositivo)
fi: Gemma 4 E2B (laitteessa)
fr: Gemma 4 E2B (sur l’appareil)
hi: Gemma 4 E2B (डिवाइस पर)
it: Gemma 4 E2B (sul dispositivo)
ja: Gemma 4 E2B（オンデバイス）
ko: Gemma 4 E2B(온디바이스)
nl: Gemma 4 E2B (op het apparaat)
pl: Gemma 4 E2B (na urządzeniu)
pt_br: Gemma 4 E2B (no dispositivo)
ro: Gemma 4 E2B (pe dispozitiv)
ru: Gemma 4 E2B (на устройстве)
uk: Gemma 4 E2B (на пристрої)
zh_hans: Gemma 4 E2B（设备端）

# gemma.downloadProgress
source: Gemma 4 download progress
ar: تقدّم تنزيل Gemma 4
az: Gemma 4 endirmə gedişatı
de: Downloadfortschritt von Gemma 4
es: Progreso de descarga de Gemma 4
fi: Gemma 4:n latauksen edistyminen
fr: Progression du téléchargement de Gemma 4
hi: Gemma 4 डाउनलोड की प्रगति
it: Avanzamento del download di Gemma 4
ja: Gemma 4 のダウンロード進捗
ko: Gemma 4 다운로드 진행률
nl: Downloadvoortgang van Gemma 4
pl: Postęp pobierania Gemma 4
pt_br: Progresso do download do Gemma 4
ro: Progresul descărcării Gemma 4
ru: Ход загрузки Gemma 4
uk: Прогрес завантаження Gemma 4
zh_hans: Gemma 4 下载进度

# gemma.verifyingDownload
source: Verifying Gemma 4 download
ar: جارٍ التحقق من تنزيل Gemma 4
az: Gemma 4 endirməsi yoxlanılır
de: Gemma-4-Download wird überprüft
es: Verificando la descarga de Gemma 4
fi: Vahvistetaan Gemma 4:n latausta
fr: Vérification du téléchargement de Gemma 4
hi: Gemma 4 डाउनलोड की पुष्टि की जा रही है
it: Verifica del download di Gemma 4
ja: Gemma 4 のダウンロードを検証中
ko: Gemma 4 다운로드 확인 중
nl: Gemma 4-download verifiëren
pl: Weryfikowanie pobranego modelu Gemma 4
pt_br: Verificando o download do Gemma 4
ro: Se verifică descărcarea Gemma 4
ru: Проверка загрузки Gemma 4
uk: Перевірка завантаження Gemma 4
zh_hans: 正在验证 Gemma 4 下载内容

# gemma.modelSource
source: Model source
ar: مصدر النموذج
az: Modelin mənbəyi
de: Modellquelle
es: Fuente del modelo
fi: Mallin lähde
fr: Source du modèle
hi: मॉडल का स्रोत
it: Fonte del modello
ja: モデルの配布元
ko: 모델 출처
nl: Modelbron
pl: Źródło modelu
pt_br: Fonte do modelo
ro: Sursa modelului
ru: Источник модели
uk: Джерело моделі
zh_hans: 模型来源

# gemma.deleteTitle
source: Delete Gemma 4?
ar: هل تريد حذف Gemma 4؟
az: Gemma 4 silinsin?
de: Gemma 4 löschen?
es: ¿Eliminar Gemma 4?
fi: Poistetaanko Gemma 4?
fr: Supprimer Gemma 4 ?
hi: Gemma 4 को हटाएं?
it: Eliminare Gemma 4?
ja: Gemma 4 を削除しますか？
ko: Gemma 4를 삭제할까요?
nl: Gemma 4 verwijderen?
pl: Usunąć Gemma 4?
pt_br: Excluir o Gemma 4?
ro: Ștergeți Gemma 4?
ru: Удалить Gemma 4?
uk: Видалити Gemma 4?
zh_hans: 删除 Gemma 4？

# gemma.deleteMessage
source: The downloaded model and its compiled cache will be removed from this iPhone. You can download it again later.
ar: ستتم إزالة النموذج الذي تم تنزيله وذاكرة التخزين المؤقت المترجمة الخاصة به من هذا الـ iPhone. يمكنك تنزيله مرة أخرى لاحقًا.
az: Endirilmiş model və onun tərtib edilmiş keş yaddaşı bu iPhone-dan silinəcək. Onu daha sonra yenidən endirə bilərsiniz.
de: Das heruntergeladene Modell und sein kompilierter Cache werden von diesem iPhone entfernt. Du kannst es später erneut herunterladen.
es: El modelo descargado y su caché compilada se eliminarán de este iPhone. Puedes volver a descargarlo más tarde.
fi: Ladattu malli ja sen käännetty välimuisti poistetaan tästä iPhonesta. Voit ladata mallin myöhemmin uudelleen.
fr: Le modèle téléchargé et son cache compilé seront supprimés de cet iPhone. Vous pourrez le télécharger à nouveau plus tard.
hi: डाउनलोड किया गया मॉडल और उसका कंपाइल किया हुआ कैश इस iPhone से हटा दिया जाएगा। आप इसे बाद में फिर से डाउनलोड कर सकते हैं।
it: Il modello scaricato e la relativa cache compilata verranno rimossi da questo iPhone. Potrai scaricarlo di nuovo in seguito.
ja: ダウンロードしたモデルとコンパイル済みキャッシュがこの iPhone から削除されます。後でもう一度ダウンロードできます。
ko: 다운로드한 모델과 컴파일된 캐시가 이 iPhone에서 삭제됩니다. 나중에 다시 다운로드할 수 있습니다.
nl: Het gedownloade model en de gecompileerde cache worden van deze iPhone verwijderd. Je kunt het later opnieuw downloaden.
pl: Pobrany model i jego skompilowana pamięć podręczna zostaną usunięte z tego iPhone’a. Możesz pobrać go ponownie później.
pt_br: O modelo baixado e o cache compilado serão removidos deste iPhone. Você poderá baixá-lo novamente mais tarde.
ro: Modelul descărcat și memoria cache compilată vor fi eliminate de pe acest iPhone. Îl puteți descărca din nou mai târziu.
ru: Загруженная модель и её скомпилированный кэш будут удалены с этого iPhone. Позже модель можно будет загрузить снова.
uk: Завантаженная модель и её скомпільований кеш будут видалені з цього iPhone. Позже модель можно будет загрузить снова.
zh_hans: 下载的模型及其编译缓存将从此 iPhone 中移除。您稍后可以重新下载。

# gemma.requires8GB
source: Requires an 8 GB RAM device
ar: يتطلب ذاكرة RAM سعتها 8 غيغابايت
az: 8 GB RAM tələb olunur
de: Erfordert 8 GB RAM
es: Requiere 8 GB de RAM
fi: Vaatii 8 Gt RAM-laitteen
fr: Nécessite 8 Go de RAM
hi: 8 GB RAM आवश्यक है
it: Richiede 8 GB di RAM
ja: 8 GB の RAM が必要です
ko: RAM 8GB 필요
nl: Vereist 8 GB RAM
pl: Wymaga 8 GB pamięci RAM
pt_br: Requer 8 GB de RAM
ro: Necesită 8 GB de RAM
ru: Требуется 8 ГБ оперативной памяти
uk: Потрібен пристрій з 8 ГБ оперативної пам'яті
zh_hans: 需要 8 GB 内存

# gemma.unsupportedDescription
source: This on-device image and text model is available on iPhones with at least 8 GB of physical memory.
ar: يتوفر نموذج الصور والنصوص هذا الذي يعمل على الجهاز على أجهزة iPhone المزودة بذاكرة فعلية لا تقل عن 8 غيغابايت.
az: Bu cihazdaxili şəkil və mətn modeli ən azı 8 GB fiziki yaddaşa malik iPhone-larda əlçatandır.
de: Dieses Bild- und Textmodell auf dem Gerät ist auf iPhones mit mindestens 8 GB physischem Arbeitsspeicher verfügbar.
es: Este modelo de imágenes y texto en el dispositivo está disponible en iPhone con al menos 8 GB de memoria física.
fi: Tämä laitteessa toimiva kuva- ja tekstimalli on käytettävissä iPhoneissa, joissa on vähintään 8 Gt fyysistä muistia.
fr: Ce modèle d’image et de texte sur l’appareil est disponible sur les iPhone disposant d’au moins 8 Go de mémoire physique.
hi: डिवाइस पर चलने वाला यह इमेज और टेक्स्ट मॉडल कम से कम 8 GB फ़िज़िकल मेमोरी वाले iPhone पर उपलब्ध है।
it: Questo modello di immagini e testo sul dispositivo è disponibile sugli iPhone con almeno 8 GB di memoria fisica.
ja: このオンデバイス画像・テキストモデルは、物理メモリを 8 GB 以上搭載した iPhone で利用できます。
ko: 이 온디바이스 이미지 및 텍스트 모델은 물리 메모리가 8GB 이상인 iPhone에서 사용할 수 있습니다.
nl: Dit beeld- en tekstmodel op het apparaat is beschikbaar op iPhones met ten minste 8 GB fysiek geheugen.
pl: Ten działający na urządzeniu model obrazu i tekstu jest dostępny na iPhone’ach z co najmniej 8 GB pamięci fizycznej.
pt_br: Este modelo de imagem e texto no dispositivo está disponível em iPhones com pelo menos 8 GB de memória física.
ro: Acest model de imagine și text de pe dispozitiv este disponibil pe iPhone-uri cu cel puțin 8 GB de memorie fizică.
ru: Эта локальная модель для изображений и текста доступна на iPhone как минимум с 8 ГБ физической памяти.
uk: Ета локальна модель для изображений и текста доступна на iPhone как минимум с 8 ГБ физической пам'яті.
zh_hans: 此设备端图像和文本模型可用于物理内存至少为 8 GB 的 iPhone。

# gemma.downloadDescription
source: 2.59 GB download. Ruoka + Treeni checks for an additional 1 GB of free installation headroom.
ar: حجم التنزيل 2.59 غيغابايت. يتحقق Ruoka + Treeni من توفر مساحة إضافية خالية قدرها 1 غيغابايت للتثبيت.
az: Endirmə ölçüsü 2,59 GB-dır. Ruoka + Treeni quraşdırma üçün əlavə 1 GB boş yerin olmasını yoxlayır.
de: 2,59 GB Download. Ruoka + Treeni prüft, ob zusätzlich 1 GB freier Speicher für die Installation verfügbar ist.
es: Descarga de 2,59 GB. Ruoka + Treeni comprueba que haya 1 GB adicional de espacio libre para la instalación.
fi: Latauksen koko on 2,59 Gt. Ruoka + Treeni tarkistaa lisäksi, että asennusta varten on 1 Gt vapaata tilaa.
fr: Téléchargement de 2,59 Go. Ruoka + Treeni vérifie qu’un espace libre supplémentaire de 1 Go est disponible pour l’installation.
hi: 2.59 GB का डाउनलोड। Ruoka + Treeni इंस्टॉलेशन के लिए 1 GB अतिरिक्त खाली जगह की जांच करता है।
it: Download da 2,59 GB. Ruoka + Treeni verifica che sia disponibile 1 GB aggiuntivo di spazio libero per l’installazione.
ja: 2.59 GB のダウンロードです。Ruoka + Treeni はインストール用にさらに 1 GB の空き容量があることを確認します。
ko: 2.59GB 다운로드입니다. Ruoka + Treeni는 설치 여유 공간으로 1GB가 추가로 비어 있는지 확인합니다.
nl: Download van 2,59 GB. Ruoka + Treeni controleert of er 1 GB extra vrije installatieruimte beschikbaar is.
pl: Pobieranie 2,59 GB. Ruoka + Treeni sprawdza, czy dostępny jest dodatkowy 1 GB wolnego miejsca na instalację.
pt_br: Download de 2,59 GB. O Ruoka + Treeni verifica se há mais 1 GB de espaço livre para a instalação.
ro: Descărcare de 2,59 GB. Ruoka + Treeni verifică dacă mai există 1 GB de spațiu liber pentru instalare.
ru: Размер загрузки — 2,59 ГБ. Ruoka + Treeni проверяет наличие ещё 1 ГБ свободного места для установки.
uk: Розмір завантаження — 2,59 ГБ. Ruoka + Treeni перевірет наличие ещё 1 ГБ вільного місця для установки.
zh_hans: 下载大小为 2.59 GB。Ruoka + Treeni 会检查是否另有 1 GB 可用安装空间。

# gemma.storedWithSize
source: Verified and stored locally (%@). Tap Prepare now, or it will load on first use.
ar: تم التحقق منه وتخزينه محليًا (%@). اضغط على «تحضير» الآن، وإلا فسيتم تحميله عند أول استخدام.
az: Yoxlanılıb və yerli olaraq saxlanılıb (%@). İndi Hazırla seçiminə toxunun, əks halda ilk istifadədə yüklənəcək.
de: Überprüft und lokal gespeichert (%@). Tippe jetzt auf „Vorbereiten“, andernfalls wird das Modell bei der ersten Verwendung geladen.
es: Verificado y almacenado localmente (%@). Toca Preparar ahora; de lo contrario, se cargará la primera vez que se use.
fi: Vahvistettu ja tallennettu paikallisesti (%@). Napauta Valmistele nyt, tai malli ladataan ensimmäisellä käyttökerralla.
fr: Vérifié et stocké localement (%@). Touchez Préparer maintenant, sinon il se chargera lors de la première utilisation.
hi: पुष्टि करके स्थानीय रूप से स्टोर किया गया (%@)। अभी तैयार करें पर टैप करें, नहीं तो यह पहली बार उपयोग करने पर लोड होगा।
it: Verificato e archiviato localmente (%@). Tocca Prepara ora, altrimenti verrà caricato al primo utilizzo.
ja: 検証され、ローカルに保存されています（%@）。今すぐ「準備」をタップしてください。操作しない場合は初回使用時に読み込まれます。
ko: 확인 후 로컬에 저장됨(%@). 지금 준비를 탭하세요. 그렇지 않으면 처음 사용할 때 불러옵니다.
nl: Geverifieerd en lokaal opgeslagen (%@). Tik nu op Voorbereiden, anders wordt het model bij het eerste gebruik geladen.
pl: Zweryfikowano i zapisano lokalnie (%@). Stuknij teraz Przygotuj, w przeciwnym razie model zostanie wczytany przy pierwszym użyciu.
pt_br: Verificado e armazenado localmente (%@). Toque em Preparar agora; caso contrário, ele será carregado no primeiro uso.
ro: Verificat și stocat local (%@). Atingeți Pregătește acum; altfel, se va încărca la prima utilizare.
ru: Проверено и сохранено локально (%@). Нажмите «Подготовить» сейчас, иначе модель загрузится при первом использовании.
uk: Перевірено та збережено локально (%@). Натисніть «Підготувати» сейчас, иначе модель завантажиться під час першого використання.
zh_hans: 已验证并存储在本地（%@）。现在轻点“准备”，否则将在首次使用时加载。

# gemma.stored
source: Verified and stored locally. Tap Prepare now, or it will load on first use.
ar: تم التحقق منه وتخزينه محليًا. اضغط على «تحضير» الآن، وإلا فسيتم تحميله عند أول استخدام.
az: Yoxlanılıb və yerli olaraq saxlanılıb. İndi Hazırla seçiminə toxunun, əks halda ilk istifadədə yüklənəcək.
de: Überprüft und lokal gespeichert. Tippe jetzt auf „Vorbereiten“, andernfalls wird das Modell bei der ersten Verwendung geladen.
es: Verificado y almacenado localmente. Toca Preparar ahora; de lo contrario, se cargará la primera vez que se use.
fi: Vahvistettu ja tallennettu paikallisesti. Napauta Valmistele nyt, tai malli ladataan ensimmäisellä käyttökerralla.
fr: Vérifié et stocké localement. Touchez Préparer maintenant, sinon il se chargera lors de la première utilisation.
hi: पुष्टि करके स्थानीय रूप से स्टोर किया गया। अभी तैयार करें पर टैप करें, नहीं तो यह पहली बार उपयोग करने पर लोड होगा।
it: Verificato e archiviato localmente. Tocca Prepara ora, altrimenti verrà caricato al primo utilizzo.
ja: 検証され、ローカルに保存されています。今すぐ「準備」をタップしてください。操作しない場合は初回使用時に読み込まれます。
ko: 확인 후 로컬에 저장됨. 지금 준비를 탭하세요. 그렇지 않으면 처음 사용할 때 불러옵니다.
nl: Geverifieerd en lokaal opgeslagen. Tik nu op Voorbereiden, anders wordt het model bij het eerste gebruik geladen.
pl: Zweryfikowano i zapisano lokalnie. Stuknij teraz Przygotuj, w przeciwnym razie model zostanie wczytany przy pierwszym użyciu.
pt_br: Verificado e armazenado localmente. Toque em Preparar agora; caso contrário, ele será carregado no primeiro uso.
ro: Verificat și stocat local. Atingeți Pregătește acum; altfel, se va încărca la prima utilizare.
ru: Проверено и сохранено локально. Нажмите «Подготовить» сейчас, иначе модель загрузится при первом использовании.
uk: Перевірено та збережено локально. Натисніть «Підготувати» сейчас, иначе модель завантажиться під час першого використання.
zh_hans: 已验证并存储在本地。现在轻点“准备”，否则将在首次使用时加载。

# gemma.downloading
source: Downloading the pinned Gemma 4 model… Keep Ruoka + Treeni open until it finishes.
ar: جارٍ تنزيل نموذج Gemma 4 المثبّت الإصدار… أبقِ Ruoka + Treeni مفتوحًا حتى يكتمل.
az: Sabitlənmiş Gemma 4 modeli endirilir… Tamamlanana qədər Ruoka + Treeni-ni açıq saxlayın.
de: Das festgelegte Gemma-4-Modell wird heruntergeladen… Lass Ruoka + Treeni geöffnet, bis der Download abgeschlossen ist.
es: Descargando el modelo fijado de Gemma 4… Mantén Ruoka + Treeni abierto hasta que termine.
fi: Ladataan kiinnitettyä Gemma 4 -mallia… Pidä Ruoka + Treeni avoinna latauksen valmistumiseen asti.
fr: Téléchargement de la version épinglée du modèle Gemma 4… Gardez Ruoka + Treeni ouvert jusqu’à la fin.
hi: पिन किया गया Gemma 4 मॉडल डाउनलोड हो रहा है… पूरा होने तक Ruoka + Treeni खुला रखें।
it: Download della versione fissata del modello Gemma 4… Mantieni Ruoka + Treeni aperto fino al termine.
ja: 固定バージョンの Gemma 4 モデルをダウンロード中… 完了するまで Ruoka + Treeni を開いたままにしてください。
ko: 고정된 버전의 Gemma 4 모델을 다운로드하는 중… 완료될 때까지 Ruoka + Treeni를 열어 두세요.
nl: De vastgezette versie van het Gemma 4-model wordt gedownload… Houd Ruoka + Treeni open totdat dit is voltooid.
pl: Pobieranie przypiętej wersji modelu Gemma 4… Nie zamykaj Ruoka + Treeni do zakończenia.
pt_br: Baixando a versão fixada do modelo Gemma 4… Mantenha o Ruoka + Treeni aberto até terminar.
ro: Se descarcă versiunea fixată a modelului Gemma 4… Mențineți Ruoka + Treeni deschis până la finalizare.
ru: Загрузка закреплённой версии модели Gemma 4… Не закрывайте Ruoka + Treeni до завершения.
uk: Завантаження закріпленої версии модели Gemma 4… Не закривайте Ruoka + Treeni до завершення.
zh_hans: 正在下载固定版本的 Gemma 4 模型… 完成前请保持 Ruoka + Treeni 打开。

# gemma.checking
source: Checking the exact file size and SHA-256 before installation…
ar: جارٍ التحقق من حجم الملف الدقيق وSHA-256 قبل التثبيت…
az: Quraşdırmadan əvvəl dəqiq fayl ölçüsü və SHA-256 yoxlanılır…
de: Exakte Dateigröße und SHA-256 werden vor der Installation überprüft…
es: Comprobando el tamaño exacto del archivo y SHA-256 antes de la instalación…
fi: Tarkistetaan tarkka tiedostokoko ja SHA-256 ennen asennusta…
fr: Vérification de la taille exacte du fichier et du SHA-256 avant l’installation…
hi: इंस्टॉल करने से पहले फ़ाइल के सटीक आकार और SHA-256 की जांच की जा रही है…
it: Verifica delle dimensioni esatte del file e di SHA-256 prima dell’installazione…
ja: インストール前に正確なファイルサイズと SHA-256 を確認中…
ko: 설치 전에 정확한 파일 크기와 SHA-256을 확인하는 중…
nl: De exacte bestandsgrootte en SHA-256 worden vóór installatie gecontroleerd…
pl: Sprawdzanie dokładnego rozmiaru pliku i sumy SHA-256 przed instalacją…
pt_br: Verificando o tamanho exato do arquivo e o SHA-256 antes da instalação…
ro: Se verifică dimensiunea exactă a fișierului și SHA-256 înainte de instalare…
ru: Проверка точного размера файла и SHA-256 перед установкой…
uk: Перевірка точного размера файла и SHA-256 перед встановленням…
zh_hans: 安装前正在检查确切的文件大小和 SHA-256…

# gemma.compiling
source: Compiling and loading the LiteRT-LM Metal runtime…
ar: جارٍ ترجمة وتحميل بيئة تشغيل LiteRT-LM Metal…
az: LiteRT-LM Metal icra mühiti tərtib edilir və yüklənir…
de: Die LiteRT-LM-Metal-Laufzeit wird kompiliert und geladen…
es: Compilando y cargando el entorno de ejecución Metal de LiteRT-LM…
fi: Käännetään ja ladataan LiteRT-LM Metal -suoritusympäristöä…
fr: Compilation et chargement du moteur d’exécution Metal de LiteRT-LM…
hi: LiteRT-LM Metal रनटाइम को कंपाइल और लोड किया जा रहा है…
it: Compilazione e caricamento del runtime Metal di LiteRT-LM…
ja: LiteRT-LM Metal ランタイムをコンパイルして読み込み中…
ko: LiteRT-LM Metal 런타임을 컴파일하고 불러오는 중…
nl: De LiteRT-LM Metal-runtime wordt gecompileerd en geladen…
pl: Kompilowanie i wczytywanie środowiska LiteRT-LM Metal…
pt_br: Compilando e carregando o runtime Metal do LiteRT-LM…
ro: Se compilează și se încarcă mediul de execuție Metal LiteRT-LM…
ru: Компиляция и загрузка среды выполнения LiteRT-LM Metal…
uk: Компіляція и завантаження середовища виконання LiteRT-LM Metal…
zh_hans: 正在编译并加载 LiteRT-LM Metal 运行时…

# gemma.readyDescription
source: Ready for private, offline food images and text.
ar: جاهز لمعالجة صور الطعام والنصوص بخصوصية ومن دون اتصال بالإنترنت.
az: Məxfi, oflayn yemək şəkilləri və mətn emalı üçün hazırdır.
de: Bereit für private Offline-Verarbeitung von Lebensmittelfotos und Text.
es: Listo para procesar imágenes de alimentos y texto de forma privada y sin conexión.
fi: Valmis yksityiseen ruokakuvien ja tekstin käsittelyyn ilman verkkoyhteyttä.
fr: Prêt pour traiter en privé et hors ligne les photos de repas et le texte.
hi: निजी, ऑफ़लाइन भोजन की तस्वीरों और टेक्स्ट के लिए तैयार।
it: Pronto per elaborare privatamente e offline immagini di alimenti e testo.
ja: 食べ物の画像とテキストをプライベートかつオフラインで処理できます。
ko: 음식 이미지와 텍스트를 비공개 오프라인으로 처리할 준비가 되었습니다.
nl: Gereed voor privéverwerking van voedingsfoto’s en tekst, zonder internetverbinding.
pl: Gotowy do prywatnego przetwarzania zdjęć jedzenia i tekstu w trybie offline.
pt_br: Pronto para processar imagens de alimentos e texto com privacidade e off-line.
ro: Pregătit pentru procesarea privată și offline a imaginilor cu alimente și a textului.
ru: Готово к конфиденциальной офлайн-обработке изображений еды и текста.
uk: Готово к конфіденційної офлайн-обробці зображень їжі и текста.
zh_hans: 已可私密、离线处理食物图像和文本。

# gemma.generating
source: Generating locally on this iPhone…
ar: جارٍ الإنشاء محليًا على هذا الـ iPhone…
az: Bu iPhone-da yerli olaraq yaradılır…
de: Wird lokal auf diesem iPhone generiert…
es: Generando localmente en este iPhone…
fi: Luodaan paikallisesti tällä iPhonella…
fr: Génération locale sur cet iPhone…
hi: इस iPhone पर स्थानीय रूप से जनरेट किया जा रहा है…
it: Generazione locale su questo iPhone…
ja: この iPhone 上でローカル生成中…
ko: 이 iPhone에서 로컬로 생성하는 중…
nl: Wordt lokaal op deze iPhone gegenereerd…
pl: Generowanie lokalne na tym iPhonie…
pt_br: Gerando localmente neste iPhone…
ro: Se generează local pe acest iPhone…
ru: Локальная генерация на этом iPhone…
uk: Локальна генерація на цьому iPhone…
zh_hans: 正在此 iPhone 上本地生成…

# gemma.error.unsupportedDevice
source: Gemma 4 requires an iPhone with at least 8 GB of memory.
ar: يتطلب Gemma 4 جهاز iPhone بذاكرة لا تقل عن 8 غيغابايت.
az: Gemma 4 üçün ən azı 8 GB yaddaşa malik iPhone tələb olunur.
de: Gemma 4 erfordert ein iPhone mit mindestens 8 GB Arbeitsspeicher.
es: Gemma 4 requiere un iPhone con al menos 8 GB de memoria.
fi: Gemma 4 vaatii iPhonen, jossa on vähintään 8 Gt muistia.
fr: Gemma 4 nécessite un iPhone disposant d’au moins 8 Go de mémoire.
hi: Gemma 4 के लिए कम से कम 8 GB मेमोरी वाला iPhone आवश्यक है।
it: Gemma 4 richiede un iPhone con almeno 8 GB di memoria.
ja: Gemma 4 には 8 GB 以上のメモリを搭載した iPhone が必要です。
ko: Gemma 4를 사용하려면 메모리가 8GB 이상인 iPhone이 필요합니다.
nl: Gemma 4 vereist een iPhone met ten minste 8 GB geheugen.
pl: Gemma 4 wymaga iPhone’a z co najmniej 8 GB pamięci.
pt_br: O Gemma 4 requer um iPhone com pelo menos 8 GB de memória.
ro: Gemma 4 necesită un iPhone cu cel puțin 8 GB de memorie.
ru: Для Gemma 4 требуется iPhone как минимум с 8 ГБ памяти.
uk: Для Gemma 4 потрібен iPhone как минимум с 8 ГБ пам'яті.
zh_hans: Gemma 4 需要内存至少为 8 GB 的 iPhone。
